app/views/events/index.html.haml

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "users".* FROM "users" WHERE "users"."id" = 6 ORDER BY "users"."id" ASC LIMIT 1
---
        %td= attendance.event.start_time
        %td= User.find(attendance.event.creator_id).name

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 29]]
---
            %td= event.name
            / %td= Location.find(event.location_id).address

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."attendee_id" = 1 ORDER BY "attendances"."id" ASC LIMIT 1  [["event_id", 1]]
---
            %td= link_to 'Edit', edit_event_path(event), class: "btn btn-primary"
            %td= link_to 'Attendance', edit_event_attendance_path(event.id, event.attendances.where(attendee_id: current_user.id).first.id), class: "btn btn-primary"