app/views/events/show.html.haml

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."creator_id" = 6 ORDER BY "attendances"."id" ASC LIMIT 1  [["event_id", 30]]
---
:javascript
  window.transport_mode = '#{@event.attendances.where(creator_id: current_user.id).first.try(:transport_mode)}'