app/views/events/show.html.haml

  %b Travel Mode:
  = @event.attendances.first.transport_mode
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 ORDER BY "attendances"."id" ASC LIMIT 1  [["event_id", 30]]

:javascript
  $(document).ready(function(){
    LocationManager.start.lat = #{@event.attendances.first.starting_location.latitude};
    LocationManager.start.lng = #{@event.attendances.first.starting_location.longitude};
    LocationManager.end.lat = #{@event.location.latitude};
    LocationManager.end.lng = #{@event.location.longitude};
    LocationManager.transport_mode = "#{@event.attendances.where(attendee_id: current_user.id).first.try(:transport_mode)}";
    LocationManager.calcRoute();
  });
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."attendee_id" = 1 ORDER BY "attendances"."id" ASC LIMIT 1  [["event_id", 4]]
SELECT "locations".* FROM "locations" WHERE "locations"."starting_location_id" = $1 LIMIT 1  [[nil, 61]]