app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT "attendances".* FROM "attendances"

  def edit
    @event = Event.find(params[:event_id])
    @attendance = @event.attendances.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "22"]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."id" = $2 LIMIT 1  [["event_id", 22], ["id", "40"]]

  def update
    @event = Event.find(params[:event_id])
    @attendance = @event.attendances.find(params[:id])
    @attendance.accepted = true

    #method for ajax request
    binding.pry
    respond_to do |format|
      if @attendance.update(attendance_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "25"]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."id" = $2 LIMIT 1  [["event_id", 25], ["id", "46"]]
UPDATE "attendances" SET "starting_location_id" = $1, "transport_mode" = $2, "trip_duration" = $3, "updated_at" = $4 WHERE "attendances"."id" = 4  [["starting_location_id", 11], ["transport_mode", "WALKING"], ["trip_duration", 1502], ["updated_at", Wed, 27 Aug 2014 18:13:44 UTC +00:00]]

  def decline_invite
    @event = Event.find(params[:event_id])
    @attendance = @event.attendances.find(params[:id])
    @attendance.accepted = false
    @attendance.save!
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "attendances" SET "accepted" = $1, "updated_at" = $2 WHERE "attendances"."id" = 6  [["accepted", false], ["updated_at", Wed, 13 Aug 2014 18:26:39 UTC +00:00]]

    def set_attendance
      @attendance = Attendance.find(params[:id])
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT 1  [["id", "28"]]