app/controllers/events_controller.rb

SELECT "attendances".* FROM "attendances" WHERE (attendee_id = current_user.id AND accepted IS NULL)
---
  def index
    # @events = current_user.events
    @events = current_user.attendances.where("accepted IS TRUE").map(&:event).compact

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "30"]]
---
  def show
    @event = current_user.events.find(params[:id])

INSERT INTO "events" ("created_at", "creator_id", "location_id", "name", "start_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "attendances" ("attendee_id", "created_at", "creator_id", "event_id", "transport_mode", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["attendee_id", 22], ["created_at", Mon, 04 Aug 2014 20:27:19 UTC +00:00], ["creator_id", 25], ["event_id", 25], ["transport_mode", "DRIVING"], ["updated_at", Mon, 04 Aug 2014 20:27:19 UTC +00:00]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
---
  def create
    @event = current_user.events.new(event_params)
    @event.creator = current_user
    # @event.address = params[:event][:location_attributes][:address]
    binding.pry
    respond_to do |format|
      if @event.save
        attendance = @event.attendances.create!(params[:event][:attendances_attributes]["0"].merge( { accepted: true, attendee: current_user, creator: current_user})
          )
          # transport_mode:
          # attendance.accepted = true
          # attendance.attendee = current_user
          # attendance.creator = current_user

          # [:transport_mode],
          # starting_location_id: params[:event][:attendances_attributes]["0"][:location_id],
          # accepted: 'TRUE',
          # attendee_id: current_user.id,
          # creator_id: current_user.id)

        if params[:attendances][:attendee_id].present?

UPDATE "events" SET "location_id" = $1, "updated_at" = $2 WHERE "events"."id" = 2  [["location_id", 4], ["updated_at", Wed, 27 Aug 2014 13:12:14 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)