app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 04 Aug 2014 18:29:31 UTC +00:00], ["friend_id", 22], ["updated_at", Mon, 04 Aug 2014 18:29:31 UTC +00:00], ["user_id", 25]]
---
  def create
    @friendship = current_user.friendships.create(friendship_params)

SELECT "users".* FROM "users" WHERE "users"."id" = 22 ORDER BY "users"."id" ASC LIMIT 1
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 22]]
UPDATE "friendships" SET "approved" = $1, "updated_at" = $2 WHERE "friendships"."id" = 12  [["approved", true], ["updated_at", Mon, 04 Aug 2014 18:30:21 UTC +00:00]]
---
  def accept_invitation
    friend = User.find(params[:id])
    friendship = current_user.inverse_friendships(friend).first
    friendship.approved = true
    friendship.save!

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 1]]
---
  def decline_invitation
    friend = User.find(params[:id])
    friendship = current_user.inverse_friendships.(friend).first