app/controllers/locations_controller.rb

  def create
    filtered_params = params.require(:location).permit(:location_label, :address, :city, :postcode, :addressable_id, :addressable_type)
    l = current_user.locations.build(filtered_params)
    if l.save
---
INSERT INTO "locations" ("address", "addressable_id", "addressable_type", "city", "created_at", "latitude", "location_label", "longitude", "postcode", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"