app/controllers/users_controller.rb

  def index
    if user_signed_in?
      @users = User.all
---
SELECT "users".* FROM "users"

  def show
    if user_signed_in?
      @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 22 ORDER BY "users"."id" ASC LIMIT 1