app/views/attendances/_form.html.haml

:javascript
  $(document).ready(function(){
    $("#startingLocation").change(function() {
      var id = this.value;
      var loc = $.grep(LocationManager.locations, function(l) {
        return l.id == id;
      })[0];
      LocationManager.start.lat = loc.lat;
      LocationManager.start.lng = loc.long;
      LocationManager.calcRoute();
    });
    LocationManager.locations = #{current_user.json_locations};
    LocationManager.start.lat = #{@event.attendances.first.starting_location.latitude};
    LocationManager.start.lng = #{@event.attendances.first.starting_location.longitude};
    LocationManager.event.lat = #{@event.location.latitude};
    LocationManager.event.lng = #{@event.location.longitude};
    LocationManager.transport_mode = "#{@event.attendances.where(attendee_id: current_user.id).first.try(:transport_mode)}";
    LocationManager.calcRoute();
  });
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."attendee_id" = 1 ORDER BY "attendances"."id" ASC LIMIT 1  [["event_id", 2]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "22"]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 1]]